MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA0E1073CNH/mcu.h
        struct
        {
            __IOM uint16_t IWDTEN  : 1; /*!< [0..0] IWDT Underflow/Refresh Error Interrupt Enable                      */
            __IOM uint16_t WDTEN   : 1; /*!< [1..1] WDT Underflow/Refresh Error Interrupt Enable                       */
            __IOM uint16_t LVD1EN  : 1; /*!< [2..2] Voltage-Monitoring 1 Interrupt Enable                              */
            __IOM uint16_t LVD2EN  : 1; /*!< [3..3] Voltage-Monitoring 2 Interrupt Enable                              */
            __IOM uint16_t VBATTEN : 1; /*!< [4..4] VBATT monitor Interrupt Enable                                     */
            uint16_t               : 1;
            __IOM uint16_t OSTEN   : 1; /*!< [6..6] Oscillation Stop Detection Interrupt Enable                        */
            __IOM uint16_t NMIEN   : 1; /*!< [7..7] NMI Pin Interrupt Enable                                           */
            __IOM uint16_t RPEEN   : 1; /*!< [8..8] RAM Parity Error Interrupt Enable                                  */
            __IOM uint16_t RECCEN  : 1; /*!< [9..9] RAM ECC Error Interrupt Enable                                     */
            __IOM uint16_t BUSSEN  : 1; /*!< [10..10] MPU Bus Slave Error Interrupt Enable                             */
            __IOM uint16_t BUSMEN  : 1; /*!< [11..11] MPU Bus Master Error Interrupt Enable                            */
            __IOM uint16_t SPEEN   : 1; /*!< [12..12] CPU Stack pointer monitor Interrupt Enable                       */
            __IOM uint16_t TZFEN   : 1; /*!< [13..13] TZFEN                                                            */
            uint16_t               : 1;
            __IOM uint16_t CPEEN   : 1; /*!< [15..15] CPEEN                                                            */
        } NMIER_b;
    };
    __IM uint16_t RESERVED4;
    __IM uint32_t RESERVED5[3];

    union
    {
        __IOM uint16_t NMICLR;          /*!< (@ 0x00000130) Non-Maskable Interrupt Status Clear Register               */

        struct
        {
            __OM uint16_t IWDTCLR  : 1; /*!< [0..0] IWDT Clear                                                         */
            __OM uint16_t WDTCLR   : 1; /*!< [1..1] WDT Clear                                                          */
            __OM uint16_t LVD1CLR  : 1; /*!< [2..2] LVD1 Clear                                                         */
            __OM uint16_t LVD2CLR  : 1; /*!< [3..3] LVD2 Clear                                                         */
            __OM uint16_t VBATTCLR : 1; /*!< [4..4] VBATT Clear                                                        */
            uint16_t               : 1;
            __OM uint16_t  OSTCLR  : 1; /*!< [6..6] OST Clear                                                          */
            __OM uint16_t  NMICLR  : 1; /*!< [7..7] NMI Clear                                                          */
            __OM uint16_t  RPECLR  : 1; /*!< [8..8] SRAM Parity Error Clear                                            */
            __OM uint16_t  RECCCLR : 1; /*!< [9..9] SRAM ECC Error Clear                                               */
            __OM uint16_t  BUSSCLR : 1; /*!< [10..10] Bus Slave Error Clear                                            */
            __OM uint16_t  BUSMCLR : 1; /*!< [11..11] Bus Master Error Clear                                           */
            __OM uint16_t  SPECLR  : 1; /*!< [12..12] CPU Stack Pointer Monitor Interrupt Clear                        */
            __IOM uint16_t TZFCLR  : 1; /*!< [13..13] TZFCLR                                                           */
            uint16_t               : 1;
            __IOM uint16_t CPECLR  : 1; /*!< [15..15] CPECLR                                                           */
        } NMICLR_b;
    };
    __IM uint16_t RESERVED6;
    __IM uint32_t RESERVED7[3];

    union
    {
        __IM uint16_t NMISR;           /*!< (@ 0x00000140) Non-Maskable Interrupt Status Register                     */

        struct
        {
            __IM uint16_t IWDTST  : 1; /*!< [0..0] IWDT Underflow/Refresh Error Status Flag                           */
            __IM uint16_t WDTST   : 1; /*!< [1..1] WDT Underflow/Refresh Error Status Flag                            */
            __IM uint16_t LVD1ST  : 1; /*!< [2..2] Voltage-Monitoring 1 Interrupt Status Flag                         */
            __IM uint16_t LVD2ST  : 1; /*!< [3..3] Voltage-Monitoring 2 Interrupt Status Flag                         */
            __IM uint16_t VBATTST : 1; /*!< [4..4] VBATT monitor Interrupt Status Flag                                */
            uint16_t              : 1;
            __IM uint16_t OSTST   : 1; /*!< [6..6] Oscillation Stop Detection Interrupt Status Flag                   */
            __IM uint16_t NMIST   : 1; /*!< [7..7] NMI Status Flag                                                    */
            __IM uint16_t RPEST   : 1; /*!< [8..8] RAM Parity Error Interrupt Status Flag                             */
            __IM uint16_t RECCST  : 1; /*!< [9..9] RAM ECC Error Interrupt Status Flag                                */
            __IM uint16_t BUSSST  : 1; /*!< [10..10] MPU Bus Slave Error Interrupt Status Flag                        */
            __IM uint16_t BUSMST  : 1; /*!< [11..11] MPU Bus Master Error Interrupt Status Flag                       */
            __IM uint16_t SPEST   : 1; /*!< [12..12] CPU Stack pointer monitor Interrupt Status Flag                  */
            __IM uint16_t TZFST   : 1; /*!< [13..13] TZFST                                                            */
            uint16_t              : 1;
            __IM uint16_t CPEST   : 1; /*!< [15..15] CPEST                                                            */
        } NMISR_b;
    };
    __IM uint16_t RESERVED8;
    __IM uint32_t RESERVED9[111];

    union
    {
        __IM uint32_t DTCENST[2];      /*!< (@ 0x00000300) DTC Enable Status Register [0..1]                          */

        struct
        {
            __IM uint32_t ST0  : 1;    /*!< [0..0] DTC Enable Status by Event Number i                                */
            __IM uint32_t ST1  : 1;    /*!< [1..1] DTC Enable Status by Event Number i                                */
            __IM uint32_t ST2  : 1;    /*!< [2..2] DTC Enable Status by Event Number i                                */
            __IM uint32_t ST3  : 1;    /*!< [3..3] DTC Enable Status by Event Number i                                */
            __IM uint32_t ST4  : 1;    /*!< [4..4] DTC Enable Status by Event Number i                                */
            __IM uint32_t ST5  : 1;    /*!< [5..5] DTC Enable Status by Event Number i                                */
            __IM uint32_t ST6  : 1;    /*!< [6..6] DTC Enable Status by Event Number i                                */
            __IM uint32_t ST7  : 1;    /*!< [7..7] DTC Enable Status by Event Number i                                */
            __IM uint32_t ST8  : 1;    /*!< [8..8] DTC Enable Status by Event Number i                                */
            __IM uint32_t ST9  : 1;    /*!< [9..9] DTC Enable Status by Event Number i                                */
            __IM uint32_t ST10 : 1;    /*!< [10..10] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST11 : 1;    /*!< [11..11] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST12 : 1;    /*!< [12..12] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST13 : 1;    /*!< [13..13] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST14 : 1;    /*!< [14..14] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST15 : 1;    /*!< [15..15] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST16 : 1;    /*!< [16..16] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST17 : 1;    /*!< [17..17] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST18 : 1;    /*!< [18..18] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST19 : 1;    /*!< [19..19] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST20 : 1;    /*!< [20..20] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST21 : 1;    /*!< [21..21] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST22 : 1;    /*!< [22..22] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST23 : 1;    /*!< [23..23] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST24 : 1;    /*!< [24..24] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST25 : 1;    /*!< [25..25] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST26 : 1;    /*!< [26..26] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST27 : 1;    /*!< [27..27] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST28 : 1;    /*!< [28..28] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST29 : 1;    /*!< [29..29] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST30 : 1;    /*!< [30..30] DTC Enable Status by Event Number i                              */
            __IM uint32_t ST31 : 1;    /*!< [31..31] DTC Enable Status by Event Number i                              */
        } DTCENST_b[2];
    };
    __IM uint32_t RESERVED10[2];

    union
    {
        __IOM uint32_t DTCENSET[2];    /*!< (@ 0x00000310) DTC Enable Set Register [0..1]                             */

        struct
        {
            __IOM uint32_t SET0  : 1;  /*!< [0..0] DTC Enable Set by Event Number i                                   */
            __IOM uint32_t SET1  : 1;  /*!< [1..1] DTC Enable Set by Event Number i                                   */
            __IOM uint32_t SET2  : 1;  /*!< [2..2] DTC Enable Set by Event Number i                                   */
            __IOM uint32_t SET3  : 1;  /*!< [3..3] DTC Enable Set by Event Number i                                   */
            __IOM uint32_t SET4  : 1;  /*!< [4..4] DTC Enable Set by Event Number i                                   */
            __IOM uint32_t SET5  : 1;  /*!< [5..5] DTC Enable Set by Event Number i                                   */
            __IOM uint32_t SET6  : 1;  /*!< [6..6] DTC Enable Set by Event Number i                                   */
            __IOM uint32_t SET7  : 1;  /*!< [7..7] DTC Enable Set by Event Number i                                   */
            __IOM uint32_t SET8  : 1;  /*!< [8..8] DTC Enable Set by Event Number i                                   */
            __IOM uint32_t SET9  : 1;  /*!< [9..9] DTC Enable Set by Event Number i                                   */
            __IOM uint32_t SET10 : 1;  /*!< [10..10] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET11 : 1;  /*!< [11..11] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET12 : 1;  /*!< [12..12] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET13 : 1;  /*!< [13..13] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET14 : 1;  /*!< [14..14] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET15 : 1;  /*!< [15..15] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET16 : 1;  /*!< [16..16] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET17 : 1;  /*!< [17..17] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET18 : 1;  /*!< [18..18] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET19 : 1;  /*!< [19..19] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET20 : 1;  /*!< [20..20] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET21 : 1;  /*!< [21..21] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET22 : 1;  /*!< [22..22] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET23 : 1;  /*!< [23..23] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET24 : 1;  /*!< [24..24] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET25 : 1;  /*!< [25..25] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET26 : 1;  /*!< [26..26] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET27 : 1;  /*!< [27..27] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET28 : 1;  /*!< [28..28] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET29 : 1;  /*!< [29..29] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET30 : 1;  /*!< [30..30] DTC Enable Set by Event Number i                                 */
            __IOM uint32_t SET31 : 1;  /*!< [31..31] DTC Enable Set by Event Number i                                 */
        } DTCENSET_b[2];
    };
    __IM uint32_t RESERVED11[2];

    union
    {
        __IOM uint32_t DTCENCLR[2];    /*!< (@ 0x00000320) DTC Enable Clear Register [0..1]                           */

        struct
        {
            __IOM uint32_t CLR0  : 1;  /*!< [0..0] DTC Enable Clear by Event Number i                                 */
            __IOM uint32_t CLR1  : 1;  /*!< [1..1] DTC Enable Clear by Event Number i                                 */
            __IOM uint32_t CLR2  : 1;  /*!< [2..2] DTC Enable Clear by Event Number i                                 */
            __IOM uint32_t CLR3  : 1;  /*!< [3..3] DTC Enable Clear by Event Number i                                 */
            __IOM uint32_t CLR4  : 1;  /*!< [4..4] DTC Enable Clear by Event Number i                                 */
            __IOM uint32_t CLR5  : 1;  /*!< [5..5] DTC Enable Clear by Event Number i                                 */
            __IOM uint32_t CLR6  : 1;  /*!< [6..6] DTC Enable Clear by Event Number i                                 */
            __IOM uint32_t CLR7  : 1;  /*!< [7..7] DTC Enable Clear by Event Number i                                 */
            __IOM uint32_t CLR8  : 1;  /*!< [8..8] DTC Enable Clear by Event Number i                                 */
            __IOM uint32_t CLR9  : 1;  /*!< [9..9] DTC Enable Clear by Event Number i                                 */
            __IOM uint32_t CLR10 : 1;  /*!< [10..10] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR11 : 1;  /*!< [11..11] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR12 : 1;  /*!< [12..12] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR13 : 1;  /*!< [13..13] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR14 : 1;  /*!< [14..14] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR15 : 1;  /*!< [15..15] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR16 : 1;  /*!< [16..16] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR17 : 1;  /*!< [17..17] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR18 : 1;  /*!< [18..18] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR19 : 1;  /*!< [19..19] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR20 : 1;  /*!< [20..20] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR21 : 1;  /*!< [21..21] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR22 : 1;  /*!< [22..22] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR23 : 1;  /*!< [23..23] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR24 : 1;  /*!< [24..24] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR25 : 1;  /*!< [25..25] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR26 : 1;  /*!< [26..26] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR27 : 1;  /*!< [27..27] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR28 : 1;  /*!< [28..28] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR29 : 1;  /*!< [29..29] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR30 : 1;  /*!< [30..30] DTC Enable Clear by Event Number i                               */
            __IOM uint32_t CLR31 : 1;  /*!< [31..31] DTC Enable Clear by Event Number i                               */
        } DTCENCLR_b[2];
    };
    __IM uint32_t RESERVED12[2];

    union
    {
        __IM uint32_t INTFLAG[2];      /*!< (@ 0x00000330) Interrupt Request Flag Monitor Register [0..1]             */

        struct
        {
            __IM uint32_t IF0  : 1;    /*!< [0..0] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF1  : 1;    /*!< [1..1] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF2  : 1;    /*!< [2..2] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF3  : 1;    /*!< [3..3] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF4  : 1;    /*!< [4..4] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF5  : 1;    /*!< [5..5] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF6  : 1;    /*!< [6..6] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF7  : 1;    /*!< [7..7] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF8  : 1;    /*!< [8..8] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF9  : 1;    /*!< [9..9] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF10 : 1;    /*!< [10..10] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF11 : 1;    /*!< [11..11] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF12 : 1;    /*!< [12..12] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF13 : 1;    /*!< [13..13] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF14 : 1;    /*!< [14..14] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF15 : 1;    /*!< [15..15] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF16 : 1;    /*!< [16..16] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF17 : 1;    /*!< [17..17] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF18 : 1;    /*!< [18..18] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF19 : 1;    /*!< [19..19] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF20 : 1;    /*!< [20..20] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF21 : 1;    /*!< [21..21] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF22 : 1;    /*!< [22..22] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF23 : 1;    /*!< [23..23] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF24 : 1;    /*!< [24..24] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF25 : 1;    /*!< [25..25] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF26 : 1;    /*!< [26..26] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF27 : 1;    /*!< [27..27] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF28 : 1;    /*!< [28..28] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF29 : 1;    /*!< [29..29] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF30 : 1;    /*!< [30..30] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF31 : 1;    /*!< [31..31] Interrupt Request Flag Monitor                                   */
        } INTFLAG_b[2];
    };
    __IM uint32_t RESERVED13[2];

    union
    {
        __IOM uint32_t SBYEDCR0;           /*!< (@ 0x00000340) Software Standby/Snooze End Control Register
                                            *                  0                                                          */

